modm-ext/data.modm.io/docs/svd/header_stm32h7s7xx.svd
        <register>
          <name>WDGPAR</name>
          <description>GFXTIM watchdog pre-alarm register</description>
          <addressOffset>0xa8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PREALARM</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HWCFGR</name>
          <description>GFXTIM HW configuration register</description>
          <addressOffset>0x3f0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>VERR</name>
          <description>GFXTIM version register</description>
          <addressOffset>0x3f4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MINREV</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MAJREV</name>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPIDR</name>
          <description>GFXTIM identification register</description>
          <addressOffset>0x3f8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ID</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SIDR</name>
          <description>GFXTIM size identification register</description>
          <addressOffset>0x3fc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SID</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="GPDMA1">
      <name>HPDMA1</name>
      <description>DMA Controller</description>
      <groupName>DMA</groupName>
      <baseAddress>0x52000000</baseAddress>
      <interrupt>
        <name>HPDMA1_Channel0</name>
        <description>HPDMA1 Channel 0 global interrupt</description>
        <value>64</value>
      </interrupt>
      <interrupt>
        <name>HPDMA1_Channel1</name>
        <description>HPDMA1 Channel 1 global interrupt</description>
        <value>65</value>
      </interrupt>
      <interrupt>
        <name>HPDMA1_Channel2</name>
        <description>HPDMA1 Channel 2 global interrupt</description>
        <value>66</value>
      </interrupt>
      <interrupt>
        <name>HPDMA1_Channel3</name>
        <description>HPDMA1 Channel 3 global interrupt</description>
        <value>67</value>
      </interrupt>
      <interrupt>
        <name>HPDMA1_Channel4</name>
        <description>HPDMA1 Channel 4 global interrupt</description>
        <value>68</value>
      </interrupt>
      <interrupt>
        <name>HPDMA1_Channel5</name>
        <description>HPDMA1 Channel 5 global interrupt</description>
        <value>69</value>
      </interrupt>
      <interrupt>
        <name>HPDMA1_Channel6</name>
        <description>HPDMA1 Channel 6 global interrupt</description>
        <value>70</value>
      </interrupt>
      <interrupt>
        <name>HPDMA1_Channel7</name>
        <description>HPDMA1 Channel 7 global interrupt</description>
        <value>71</value>
      </interrupt>
      <interrupt>
        <name>HPDMA1_Channel8</name>
        <description>HPDMA1 Channel 8 global interrupt</description>
        <value>141</value>
      </interrupt>
      <interrupt>
        <name>HPDMA1_Channel9</name>
        <description>HPDMA1 Channel 9 global interrupt</description>
        <value>142</value>
      </interrupt>
      <interrupt>
        <name>HPDMA1_Channel10</name>
        <description>HPDMA1 Channel 10 global interrupt</description>
        <value>143</value>
      </interrupt>
      <interrupt>
        <name>HPDMA1_Channel11</name>
        <description>HPDMA1 Channel 11 global interrupt</description>
        <value>144</value>
      </interrupt>
      <interrupt>
        <name>HPDMA1_Channel12</name>
        <description>HPDMA1 Channel 12 global interrupt</description>
        <value>145</value>
      </interrupt>
      <interrupt>
        <name>HPDMA1_Channel13</name>
        <description>HPDMA1 Channel 13 global interrupt</description>
        <value>146</value>
      </interrupt>
      <interrupt>
        <name>HPDMA1_Channel14</name>
        <description>HPDMA1 Channel 14 global interrupt</description>
        <value>147</value>
      </interrupt>
      <interrupt>
        <name>HPDMA1_Channel15</name>
        <description>HPDMA1 Channel 15 global interrupt</description>
        <value>148</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>DMA2D</name>
      <description>DMA2D Controller</description>
      <groupName>DMA2D</groupName>
      <baseAddress>0x52001000</baseAddress>
      <interrupt>
        <name>DMA2D</name>
        <description>DMA2D global interrupt</description>
        <value>98</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>DMA2D Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>START</name>
              <description>Start transfer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SUSP</name>
              <description>Suspend transfer</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ABORT</name>
              <description>Abort transfer</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOM</name>
              <description>Line Offset Mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PIXELS</name>
                  <description>Line offsets are expressed in pixels</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYTES</name>
                  <description>Line offsets are expressed in bytes</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEIE</name>
              <description>Transfer Error Interrupt Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCIE</name>
              <description>Transfer Complete Interrupt Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TWIE</name>
              <description>Transfer Watermark Interrupt Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAEIE</name>
              <description>CLUT Access Error Interrupt Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTCIE</name>
              <description>CLUT Transfer Complete Interrupt Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CEIE</name>
              <description>Configuration Error Interrupt Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MODE</name>
              <description>DMA2D Mode[2:0]</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M2M</name>
                  <description>DMA2D memory to memory transfer mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2M_PFC</name>
                  <description>DMA2D memory to memory with pixel format conversion transfer mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2M_BLEND</name>
                  <description>DMA2D memory to memory with blending transfer mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R2M</name>
                  <description>DMA2D register to memory transfer mode</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2M_BLEND_FIXED_COLOR_FG</name>
                  <description>DMA2D memory to memory with blending transfer mode and fixed color foreground</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2M_BLEND_FIXED_COLOR_BG</name>
                  <description>DMA2D memory to memory with blending transfer mode and fixed color background</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <description>DMA2D Interrupt Status Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TEIF</name>
              <description>Transfer Error Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCIF</name>
              <description>Transfer Complete Interrupt Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TWIF</name>
              <description>Transfer Watermark Interrupt Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAEIF</name>
              <description>CLUT Access Error Interrupt Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTCIF</name>
              <description>CLUT Transfer Complete Interrupt Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CEIF</name>
              <description>Configuration Error Interrupt Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IFCR</name>
          <description>DMA2D Interrupt Flag Clear Register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CTEIF</name>
              <description>Clears Transfer Error Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTCIF</name>
              <description>Clears Transfer Complete Interrupt Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTWIF</name>
              <description>Clears Transfer Watermark Interrupt Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAECIF</name>
              <description>Clears CLUT Access Error Interrupt Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCTCIF</name>
              <description>Clears CLUT Transfer Complete Interrupt Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCEIF</name>
              <description>Clears Configuration Error Interrupt Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FGMAR</name>
          <description>DMA2D Foreground Memory Address Register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MA</name>
              <description>Memory Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FGOR</name>
          <description>DMA2D Foreground</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>Line Offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BGMAR</name>
          <description>DMA2D Background Memory Address Register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MA</name>
              <description>Memory Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BGOR</name>
          <description>DMA2D Background</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>Line Offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FGPFCCR</name>
          <description>DMA2D Foreground PFC Control Register</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CM</name>
              <description>Input color mode CM[3:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARGB8888</name>
                  <description>ARGB8888</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGB888</name>
                  <description>RGB888</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGB565</name>
                  <description>RGB565</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARGB1555</name>
                  <description>ARGB1555</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARGB4444</name>
                  <description>ARGB4444</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L8</name>
                  <description>L8</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AL44</name>
                  <description>AL44</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AL88</name>
                  <description>AL88</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L4</name>
                  <description>L4</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A8</name>
                  <description>A8</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A4</name>
                  <description>A4</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCM</name>
              <description>CLUT Color mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARGB8888</name>
                  <description>ARGB8888</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGB888</name>
                  <description>RGB888</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>START</name>
              <description>Start</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CS</name>
              <description>CLUT size</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>AM</name>
              <description>Alpha mode AM[1:0]</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_MODIF</name>
                  <description>No modification of the alpha channel value</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPLACE</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMBINE</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSS</name>
              <description>Chroma Sub-Sampling</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CSS_444</name>
                  <description>No chroma sub-sampling 4:4:4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSS_422</name>
                  <description>chroma sub-sampling 4:2:2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSS_420</name>
                  <description>chroma sub-sampling 4:2:0</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AI</name>
              <description>Alpha Inverted</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REGULAR</name>
                  <description>Regular alpha</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERTED</name>
                  <description>Inverted alpha</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RBS</name>
              <description>Red Blue Swap</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REGULAR</name>
                  <description>RGB or ARGB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWAP</name>
                  <description>BGR or ABGR</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALPHA</name>
              <description>Alpha value</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FGCOLR</name>
          <description>DMA2D Foreground Color Register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BLUE</name>
              <description>Blue Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>GREEN</name>
              <description>Green Value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>RED</name>
              <description>Red Value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
